<!doctype html>
<html lang="ar">

<head>
    <!-- Required meta tags -->
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1, shrink-to-fit=no">
    <meta http-equiv="x-ua-compatible" content="ie=edge">


    <title>@yield('page_title')</title>



    @include('website.inc._css')
    @yield('styles')
</head>

<body>

<!-- ================ spinner ================= -->
{{--<div class="spinner">--}}
{{--    <div class="loader">--}}
{{--        <div>--}}
{{--            <ul>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--                <li>--}}
{{--                    <svg viewBox="0 0 90 120" fill="currentColor">--}}
{{--                        <path--}}
{{--                            d="M90,0 L90,120 L11,120 C4.92486775,120 0,115.075132 0,109 L0,11 C0,4.92486775 4.92486775,0 11,0 L90,0 Z M71.5,81 L18.5,81 C17.1192881,81 16,82.1192881 16,83.5 C16,84.8254834 17.0315359,85.9100387 18.3356243,85.9946823 L18.5,86 L71.5,86 C72.8807119,86 74,84.8807119 74,83.5 C74,82.1745166 72.9684641,81.0899613 71.6643757,81.0053177 L71.5,81 Z M71.5,57 L18.5,57 C17.1192881,57 16,58.1192881 16,59.5 C16,60.8254834 17.0315359,61.9100387 18.3356243,61.9946823 L18.5,62 L71.5,62 C72.8807119,62 74,60.8807119 74,59.5 C74,58.1192881 72.8807119,57 71.5,57 Z M71.5,33 L18.5,33 C17.1192881,33 16,34.1192881 16,35.5 C16,36.8254834 17.0315359,37.9100387 18.3356243,37.9946823 L18.5,38 L71.5,38 C72.8807119,38 74,36.8807119 74,35.5 C74,34.1192881 72.8807119,33 71.5,33 Z">--}}
{{--                        </path>--}}
{{--                    </svg>--}}
{{--                </li>--}}
{{--            </ul>--}}
{{--        </div>--}}
{{--    </div>--}}
{{--</div>--}}
<!-- ================ spinner ================= -->


@if( request()->get("view_type") != "webView" )
    @include('website.inc._header')
@endif

<!-- Header Area End Here -->



<!-- start content -->
    @yield('content')
<!-- end content -->




@if( request()->get("view_type") != "webView" )
    @include('website.inc._footer')
@endif

<!-- ========================= Modal ========================== -->

<div class="ClassLessons modal fade" id="ClassLessons" tabindex="-1" role="dialog" aria-hidden="true">
    <div class="modal-dialog modal-dialog-centered modal-lg">
        <div class="modal-content">
            <div class="modal-header">
                <p class="modal-title"> <i class="fas fa-book-reader color2"></i> المرحلة الابتدائية (<span> الصف الدراسي
              الاول </span>) </p>
                <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                </button>
            </div>
            <div class="modal-body">
                <div class="row">
                    <div class=" col-lg-3 col-md-4 col-6 modalCol">
                        <a href="studying-subjects.html">
                            <div class="lessonName">
                                <div class="lessonImg">
                                    <img src="{{asset('website')}}/img/arabic book.png">
                                </div>
                                <h6>اللغة العربية</h6>
                            </div>
                        </a>
                    </div>
                    <div class=" col-lg-3 col-md-4 col-6 modalCol">
                        <a href="studying-subjects.html">
                            <div class="lessonName">
                                <div class="lessonImg">
                                    <img src="{{asset('website')}}/img/english book.png">
                                </div>
                                <h6>اللغة الانجليزية</h6>
                            </div>
                        </a>
                    </div>
                    <div class=" col-lg-3 col-md-4 col-6 modalCol">
                        <a href="studying-subjects.html">
                            <div class="lessonName">
                                <div class="lessonImg">
                                    <img src="{{asset('website')}}/img/l1.png">
                                </div>
                                <h6> علوم </h6>
                            </div>
                        </a>
                    </div>
                    <div class=" col-lg-3 col-md-4 col-6 modalCol">
                        <a href="studying-subjects.html">
                            <div class="lessonName">
                                <div class="lessonImg">
                                    <img src="{{asset('website')}}/img/historyyy.png">
                                </div>
                                <h6>دراسات</h6>
                            </div>
                        </a>
                    </div>
                    <div class=" col-lg-3 col-md-4 col-6 modalCol">
                        <a href="studying-subjects.html">
                            <div class="lessonName">
                                <div class="lessonImg">
                                    <img src="{{asset('website')}}/img/l2.png">
                                </div>
                                <h6>رياضيات </h6>
                            </div>
                        </a>
                    </div>

                </div>

            </div>
        </div>
    </div>
</div>

<!-- ========================= Modal ========================== -->



{{-- ==================================== check money ================================ --}}
<div class="modal fade" id="m_modal_student_live" tabindex="-1" role="dialog" aria-labelledby="exampleModalLabel" aria-hidden="true">


    <div class="modal-dialog modal-lg" role="document">
        <div class="modal-content">
            <div class="modal-header">
                <h5 class="modal-title" id="exampleModalLabel">عرض</h5>
                <button type="button" class="close" data-dismiss="modal" aria-label="Close">
                    <span aria-hidden="true">&times;</span>
                </button>
            </div>

                <div class="view-msg"></div>

        </div>
    </div>


</div>
{{-- ==================================== check money ================================ --}}

<!-- Begin _jsChat| Modal Area -->
{{--@include('website.inc._jsChat')--}}
<!-- _jsChat | _jsChat End Here -->


@include('website.inc._js')


@push('js')

    @include('website.ajaxCode')

</body>

@toastr_render

<!-- index30:23-->

</html>
